archives/2024/Results/Verifications/S2427/bottleneck-determination/update_index/threads-20/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=20 oltp_update_index --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-ty
pe=uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 20
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 20 tps: 4433.58 qps: 4433.58 (r/w/o: 0.00/4325.23/108.35) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 20 tps: 4281.78 qps: 4281.78 (r/w/o: 0.00/4181.08/100.70) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 20 tps: 4530.17 qps: 4530.17 (r/w/o: 0.00/4417.08/113.10) lat (ms,95%): 6.79 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 20 tps: 4625.29 qps: 4625.29 (r/w/o: 0.00/4511.39/113.90) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 20 tps: 4490.41 qps: 4490.41 (r/w/o: 0.00/4377.41/113.00) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 20 tps: 4580.59 qps: 4580.59 (r/w/o: 0.00/4472.39/108.20) lat (ms,95%): 6.79 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 20 tps: 4611.10 qps: 4611.10 (r/w/o: 0.00/4496.90/114.20) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 20 tps: 4726.27 qps: 4726.27 (r/w/o: 0.00/4609.77/116.50) lat (ms,95%): 6.32 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 20 tps: 4489.32 qps: 4489.32 (r/w/o: 0.00/4377.12/112.20) lat (ms,95%): 6.91 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 20 tps: 4134.45 qps: 4134.45 (r/w/o: 0.00/4037.15/97.30) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           438096
        other:                           10975
        total:                           449071
    transactions:                        449071 (4490.00 per sec.)
    queries:                             449071 (4490.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0114s
    total number of events:              449071

Latency (ms):
         min:                                    1.15
         avg:                                    4.45
         max:                                  224.39
         95th percentile:                        7.04
         sum:                              1999410.88

Threads fairness:
    events (avg/stddev):           22453.5500/51.44
    execution time (avg/stddev):   99.9705/0.00


real    1m40.119s
user    0m7.344s
sys     0m17.551s